Repository: racdenis/another_one_shopini_editor
Catalog: SHOPINI Editor/Properties/Resources.*.resx
Languages: ru_ru

# create_shop
source: Create SHOPINI
ru_ru: Создать SHOPINI

source: Exit
ru_ru: Выход

source: File
ru_ru: Файл

# iteminfo_not_ok
source: ITEMINFO not found!
ru_ru: ITEMINFO не найден!

# iteminfo_ok
source: ITEMINFO found
ru_ru: ITEMINFO обнаружен.

# iteminfo_set
source: Set ITEMINFO...
ru_ru: Указать ITEMINFO...

# item_edit_form
source: Item edit
ru_ru: Редактирование предмета

# item_text
source: Item
ru_ru: Предмет

# level_text
source: Level
ru_ru: Уровень

# main_form
source: Another one SHOPINI editor
ru_ru: Ещё один редактор SHOPINI

source: Mass edit
ru_ru: Массовое редактирование

# open_iteminfo
source: ITEMINFO path...
ru_ru: Путь до ITEMINFO...

# open_shop
source: Open SHOPINI
ru_ru: Открыть SHOPINI

# price_text
source: Price
ru_ru: Цена

# save_shop
source: Save SHOPINI
ru_ru: Сохранить SHOPINI

# save_shop_as
source: Save SHOPINI as
ru_ru: Сохранить SHOPINI как

# shopname_text_en
source: Shopname (english)
ru_ru: Название (англ)

# shopname_text_ru
source: Shopname
ru_ru: Название

# type_text
source: Type
ru_ru: Тип

# add_new
source: Add Item
ru_ru: Добавить строку

source: Apply Change
ru_ru: Применить изменения

source: Clear all data?
ru_ru: Очистить все данные?

# replace_string_or_not
source: Replace existing string?
ru_ru: Заменить уже существующую строку?

# replace_file_ask
source: File already exists. Replace?
ru_ru: Файл уже существует. Заменить?

# eng_version_mark
source: Checking this will create SHOPINI_ENG folder in saved file directory with identical SHOPINI file, only with localized shop/box name
ru_ru: Создаст папку SHOPINI_ENG рядом с сохраняемым файлом, в котором сохранится копия SHOPINI файла, отличающаяся названием магазина/коробки

# help_menuitem
source: Help
ru_ru: Помощь

# help_text_1
source: This app is intended for SHOPINI files editing. Don't forget to place ITEMINFO file in the app directory. Item classname and name fields work as search fields with results in drop-down list. Controls:
ru_ru: Программа предназначена для редактирования SHOPINI файлов. Обязательно поместите ITEMINFO рядом с программой. Поля набора класснеймов и названий предметов работают как поиск, в выпадающем списке появляются варианты. Управление:

# help_text_2
source: ENTER - while "item", "level" and "price" edit boxes in lower part of app are active adds new item to list if shop type is 1, if shop type is 0 or 2 asks if you want to replace existing item data (if it exists) or adds this item
ru_ru: ENTER - при активных строках "предмет", "уровень", "цена" внизу добавляет строку при типе магазина 1, при 0 и 2 предлагает заменить существующую новыми данными, если указанный предмет уже имеется, если нет - добавляет строку

# help_text_3
source: DELETE - removes one or multiple selected strings
ru_ru: DELETE - удаляет выбранные строки (одну или несколько)

# help_text_5
source: You can change one or multiple parameters of multiple items. Select items, change parameters you want and just apply changes.
ru_ru: При выборе нескольких строк есть возможность редактирования одного или нескольких параметров. Для этого нужно изменить нужные параметры и принять изменения.

# help_text_6
source: You can edit SHOPINI for two languages, check the corresponding checkbox if needed. The second file with localized name will be saved in SHOPINI_ENG folder in saved file directory.
ru_ru: Присутствует возможность сохранения одновременно на двух языках. Для этого отметьте соответствующий пункт рядом с названием магазина/коробки. Второй файл будет сохранён в папке SHOPINI_ENG, созданной в директории сохраняемого файла.

# help_text_7
source: If you want something and I can help with it - vk.com/abb_228 (https://vk.com/id271343327), racdenis@yandex.ru, Discord: abb_228, Steam: racdenis_
ru_ru: По каким-нибудь вопросам можно в vk.com/abb_228 (https://vk.com/id271343327), racdenis@yandex.ru, Discord: abb_228, Steam: racdenis_
